{
    "posts": [
        {
            "postid": 1,
            "title": "Kerwin Tang for CCAPDEV",
            "body":"Hey guys! I got Kerwin Tang for this term and I can't find recent feedback about him in Profs2Pick. Can anyone give honest feedback and tips to get #Ez4.0 ^__^",
            "comments": 3,
            "user": "nathan",
            "img": "https://scontent.fcrk1-4.fna.fbcdn.net/v/t39.30808-6/294806317_10161195484146808_7368166100708413404_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=174925&_nc_eui2=AeEzwPJDrs-qbuZja_ve8yzDLpmo3Np8H48umajc2nwfj5KKHMUk_yC3ZBgmx6sJhp0&_nc_ohc=Anb7RMigl9gAX9Cfbr8&_nc_ht=scontent.fcrk1-4.fna&oh=00_AfC47pe4WZDVj6LPItxBMqXPRuJie5xpLoC6NDSGr5JoHw&oe=649A5AAE",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "patty",
                    "comment": "In my experience, he's an exceptional instructor. His lectures are clear and organized, making it easy to understand the material. He encourages class participation and creates a supportive environment for questions.",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "matt",
                    "comment": "Professor Tang provides valuable feedback on assignments and is approachable during office hours. I highly recommend attending lectures, actively participating, and reviewing materials to excel in his class.",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "jex",
                    "comment": "In my opinion, he's an amazing professor who truly knows his stuff. His lectures are engaging and well-prepared, making it easy to follow along and grasp the concepts.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 2,
            "title": "When you first stepped in DLSU, what are you amazed in the university?",
            "body":"I'm an incoming ID 123 student and was wondering if my seniors can share things about the university I can look forward to. Im so excited for the frosh welcoming!",
            "comments": 50,
            "user": "patty",
            "img": "https://scontent.fcrk1-5.fna.fbcdn.net/v/t39.30808-6/323044217_594634382671516_7065407932327472719_n.jpg?stp=cp6_dst-jpg&_nc_cat=104&ccb=1-7&_nc_sid=09cbfe&_nc_eui2=AeGnmu13q1N7RVAwPri2U23_EaVpWHtd0LARpWlYe13QsGq2Sqi4hyi4xJSBhCnvnIY&_nc_ohc=-PhjMCGNlyYAX_5-S6j&_nc_ht=scontent.fcrk1-5.fna&oh=00_AfAQjLNtIkKiSaVpihUB5iOL-ncJSHL8xzMTehgS6d1OuA&oe=64933C2C",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "matt",
                    "comment": "I got my undergrad degree at MAPUA and then went to DLSU Taft for my Masters Degree. The first thing that blew me away was the facilities and labs. When I was an undergrad, I had all these research ideas I wanted to try out, but not as part of a thesis. My school back then didn’t really have many chances for us to do our own research. But when I got to DLSU, there were all these opportunities right from my first year. Of course, I jumped at the chance to join a research lab and finally got to share my ideas from undergrad and hopefully actually make them happen.",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "nathan",
                    "comment": "I come from a science high school where we share old, and sometimes dilapidated, books, where our electrical post sometimes explode (brownouts in every start of school yr), and all the dirty stuff when you think of a public school. I entered dlsu btw in shs. To me Henry sy was just so ✨MAJESTIC✨. ELEVATORS, PILLARS, AND THIS PRODIJOUS SPACE UNDERNEATH ARE JUST SO BEAUTIFUL. I also think of Razon as a playground for rich kids ✨. DLSU was really out of this world to me. Even in academics, it differs from a science high school. It so holistic unlike in my previous school where everything is purely academics. So yeah, you can tell how I enjoy being here.",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "jex",
                    "comment": "The very first thing that amazed me was Henry in general. The walkways where you can see the front, the giant pillars underneath, and the escalators inside. But as I slowly became more and more accustomed to the campus, I learned to appreciate the smaller details - Ethnic diversity, cats around Velasco, bathrooms with lighting you can flex to, and no uniform.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 3,
            "title": "DLSU alumni where are you now?",
            "body":"I wanna know if it’s true that a DLSU diploma gets you better opportunities than schools outside of Big 4 since sabi nila “mabango” daw sa resume ang DLSU. Was it easy landing a job because of your diploma? because with DLSU’s price it better do 😂, Or do you think you should have settled for other unis?",
            "comments": 4,
            "user": "matt",
            "img": "https://www.codespeedy.com/wp-content/uploads/2020/01/low.jpg",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "jex",
                    "comment": "International Studies, CLA. Had tons of offers after graduation and eventually settling with the airline industry. Changed career to a more corporate setting with side hustles (translator/interpreter, got free hotels and travels) and now have my own business/passive income and enjoying my own time. La Salle really does open up opportunities for its graduates. The school speaks for itself and personally, I think one of the most important things that La Salle gave me after graduation was confidence. Might be a CLA thing, but they really teach you to stand up and conquer your inhibitions in Miguel. :)",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "matt",
                    "comment": "I had one of those engineering degrees which no one wants to get into. The opportunities are countless after graduation. You just have to choose which career path will you take. I packed my bags and went to work in a semiconductor company after graduation. Now, I am doing a less stressful job in HR and have businesses on the side.",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "patty",
                    "comment": "Currently job hunting right now, and I’m pretty sure having DLSU on my resume gets my foot in doors that would have been closed otherwise. As said above, it’s also a big advantage when applying for MT programs and the like, so far I’ve been getting to at least the interview stage in most jobs I’ve applied for.",
                    "numComments": 1
                },
                {
                    "commentid": 4,
                    "user": "nathan",
                    "comment": "ID 116 CCS BSCS. DLSU is literally THE top CS uni in PH so I didn't have any troubles with getting a job as a fresh grad. Well it was mostly my portfolio and achievements but I found it pretty easy making connections with upperclassmen on LinkedIn and seeing which companies they work in (in other words, which companies hired DLSU students the most or smthn). Then all just took off from there. I now work as a Software Engineer at Meta California.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 4,
            "title": "UPD Computer Engineering or DLSU Computer Science?",
            "body":"Incoming freshmen here, hoping I can get some guidance on which university I’ll choose. Thank you! I got in Computer Science - SoftTech sa DLSU. I was super happy since that was my 1st choice course. Afterwards, I got accepted into UP Diliman, although, it was my 2nd choice - Computer Engineering. I understand that there’s some overlap in terms of job outlook and subjects. So, more or less, perhaps being a software engineer is still on the table (?) or baka magsshift ako, although I think I will have to spend one more year. The thing is, browsing online, I can’t seem to pinpoint which college I’m truly interested in, each with its own pros and cons. My parents are advocating for UP since free nga naman yung tuition. Perhaps you guys can help guide me in weighing my options 😁",
            "comments": 32,
            "user": "jex",
            "img": "https://i.pinimg.com/236x/71/28/3b/71283bb49db55cfee5bb6acd1389c465--tree-of-life-the-tree.jpg",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "nathan",
                    "comment": "Computer engineering in UPD is under EEEI which also houses two other programs, electrical engineering and electronics engineering. With this said, the CoE curriculum of upd is quite different from other unis since the three programs in the institute share exactly the same courses until 3rd year 1st sem. So you're gonna be studying broadly and at the same time extensively about topics in the other fields such as circuits, power, communications, semiconductors, signals, etc. Tapos pagdating naman sa specialization majors na in the computer engineering, medyo different yung approach ng EEEI since we are not learning any specific tools in solving problems. You can view how you want it but it's technology-agnostic kumbaga unlike in other courses offered in other universities, you are somehow at least trained or expected to have a specific skillset or say tech stack after college. Here, it's a big culture of rigorous and just enough independent studying so that you can be prepared for any kind of career path you want after.",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "matt",
                    "comment": "If you love programming but hate circuits, dont go to UP EEEI",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "patty",
                    "comment": "Since wala pa sumagot sa expenses. Keep in mind that La Salle is quite expensive due to the tuition while rent for condos or dormitories are generally similar (UP has free lodging if you're financially struggling). If that's a major factor for you, I would suggest UP, otherwise stick with La Salle.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 5,
            "title": "TRANSFERRING TO DLSU AFTER 2 TERMS",
            "body":"Hello! I am currently enrolled po as a freshmen sa MAPUA CE and I am planning to transfer to DLSU after two terms (as instructed sa website) and may I know kung may naka experience naba dito ng pagtransfer sa DLSU for term 3? Is it really hassle po ba? I am fully aware of the delay din pero considering na I will transfer bago pa ako mag 2nd year, magiging irreg padin ba ako? Or magkakaroon pa po ba akong chance na maging regular?",
            "comments": 241,
            "user": "christian_james",
            "img": "https://images.unsplash.com/photo-1544005313-94ddf0286df2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1yZWxhdGVkfDE0fHx8ZW58MHx8fHx8&w=1000&q=80",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "jex",
                    "comment": "As a fellow CE student, I think you won't be delayed that much if tapos ka na sa mga calculus and physics mo. I know someone who transferred out of MAPUA rin to DLSU, may slight gaps na need ayusin in terms of the flowchart. Pero the good thing is you can have a chance of being a regular in ur 2nd or 3rd year kasi first year subjects and the first half of second year subjects have hard requisites on calculus and physics.",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "patty",
                    "comment": "Hi OP! I've been in DLSU since SHS, and here's what I can answer for u: Trisem sa DLSU and froshies have the chance to enroll during our 3rd term! Bali, you joining in 3rd term is not too out of place 🤗",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "nathan",
                    "comment": "Check the calendars between Mapua and DLSU muna to set some expectations kung makakaapply ka to transfer. Depending on already taken courses in Mapua (if the Associate Dean in GCOE will credit them) and the CE flowchart of DLSU, baka irregular or close to regular.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 6,
            "title": "Will i still get into dlsu with a low grade in 8th and 9th grade?",
            "body":"Hi im an incoming grade 11 student and i was an average kid in 7th grade—below even, however, things tarted to change during my 8th and 9th. It was the start of pandemic and online classes were held in our school. I fell back and failed a subject. I also had numerous line of 7 during those two school years. When my school announced that the face to face classes will be implemented and i was able to do better in school, probably above average but not really the type of student who will get an honorary award because I was still grasping and trying to fathom on some things after this whole chaos. Math and physics (all the math stuff) were really my weaknesses during 10th grade that's why i'm pursuing humss. (Never had a line of 7 this time and my lowest was 86 that's why i wasn't able to get an award despite having a high honor gen ave 😭) Anyway, me and my friends are trying to study as early as now (1 year until upcat 2024 and the rest of cets) because to them it was just to prepare themselves, but to me, it was to really thrive and do well in my cets especially dcat since dlsu's my first choice. My worry is that will i still be able to get in dlsu despite having low grades in 8th and 9th?",
            "comments": 15,
            "user": "nathan",
            "img": "https://scontent.fcrk1-4.fna.fbcdn.net/v/t39.30808-6/294806317_10161195484146808_7368166100708413404_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=174925&_nc_eui2=AeEzwPJDrs-qbuZja_ve8yzDLpmo3Np8H48umajc2nwfj5KKHMUk_yC3ZBgmx6sJhp0&_nc_ohc=Anb7RMigl9gAX9Cfbr8&_nc_ht=scontent.fcrk1-4.fna&oh=00_AfC47pe4WZDVj6LPItxBMqXPRuJie5xpLoC6NDSGr5JoHw&oe=649A5AAE",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "matt",
                    "comment": "Ph UNIS only ask for your transcripts from Gr 9-11 so you don’t have to pas Gr 7-8 transcripts ++just do good with the DCAT. I don’t know how the passing rate is now (since they’ve been accepting majority of the applicants aka overcrowded campus) but around the 2020-2021 DCAT they passed the majority of applicants and recons (just depends if you get the Degree you want).",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "nathan",
                    "comment": "Who you can be matters more than who you are. Give it a shot. Your drive and commitment to thrive may make a difference in your future. : ) Doubting yourself a lot will only limit such possibilities.",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "patty",
                    "comment": "I'm an incoming ID 123, DLSU only ask for your GWA through grades 9th to 11th. I was consistently getting 80% flat (there were lines of 7, even in major subjects). Even then, I still passed my priority program, a double degree between SOE & RVRCOB. Whilst numerous schoolmates of mine with higher grades were rejected/waitlisted/redirected. I'd say your best bet is to do really well on DCAT. On a side note, I didn't really prepare for the DCAT. I just relied on stock knowledge and common sense. I guess I got lucky or my 'stock' knowledge were top-tier??",
                    "numComments": 1
                },
                {
                    "commentid": 4,
                    "user": "jex",
                    "comment": "To get into DLSU, yes you need good grades (as long as u don't fail or mess up senior high i guess it's not that big of a problem?? although they do check your grade 9 scores, but, 8th grade not so much). Although, kung maganda grades mo pero di ka naman nakapasa ng DCAT, it'll be a huge problem. DCAT is a big factor for ur acceptance. Phillippines CETs are typically STEM-centered tbh but don't fret, DCAT is fairly easy. I believe it's the easiest CET out of the top 4 unis (UP, ADMU, UST). NOTE: USTET was really hard, very STEM-based siya (hindi ako STEM student) so I guessed my way through the whole test but I thankfully passed. ACET was okay but we only had a limited amount of time talaga, same with USTET. But this isn't the case with DCAT. DCAT gives u just the right amount of time to answer all of the questions <3 ). If you are weak in math and science, then you should definitely study hard and focus on that when you're preparing for the DCAT. I suggest you take a lottt of practice tests. When I took DCAT a few months ago, mainly trigo, geometry, and logarithms mga nasa test for Math. But to give u some comfort, tbh I also guessed my way through the Math and Science portion ng DCAT pero nakapasok naman ako for an engineering program so may chance talaga",
                    "numComments": 1
                },
                {
                    "commentid": 5,
                    "user": "jex",
                    "comment": "Who you can be matters more than who you are. Give it a shot. Your drive and commitment to thrive may make a difference in your future. : ) Doubting yourself a lot will only limit such possibilities.",
                    "numComments": 1
                }
            ]
        },
        {
            "postid": 7,
            "title": "What makes DLSU distinct compared to other universities?",
            "body":"Hi! I am currently discerning on what university to choose for college, DLSU or ADMU. I got into applied mathematics (AMF) in ADMU, and manufacturing engineering (MEM-MRE) in DLSU. I like my courses for both universities since they open a lot of opportunities post grad, so it makes the decision a lot harder when it comes to picking the school. I’d like to ask current/incoming students the following questions. What makes La Salle stand out from the Big 4? Why did you choose La Salle? I’d really appreciate your help! Thank you in advance :)",
            "comments": 1,
            "user": "nathan",
            "img": "https://scontent.fcrk1-4.fna.fbcdn.net/v/t39.30808-6/294806317_10161195484146808_7368166100708413404_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=174925&_nc_eui2=AeEzwPJDrs-qbuZja_ve8yzDLpmo3Np8H48umajc2nwfj5KKHMUk_yC3ZBgmx6sJhp0&_nc_ohc=Anb7RMigl9gAX9Cfbr8&_nc_ht=scontent.fcrk1-4.fna&oh=00_AfC47pe4WZDVj6LPItxBMqXPRuJie5xpLoC6NDSGr5JoHw&oe=649A5AAE",
            "postcomments": [
                {
                    "commentid": 1,
                    "user": "jex",
                    "comment": "Perfect utilization of the trimestral system, strongest linkages with corporate and foreign universities and boasting an intense research curriculum that it is almost a brand for the university.",
                    "numComments": 1
                },
                {
                    "commentid": 2,
                    "user": "patty",
                    "comment": "The university tests the patience of the students by making the server crash during enrollment time. Aside from that the system of wanting to change sections sure is very friendly if one wants to change sections they would need to reach the department they are in and if the student chooses to go to the department in person the intercom that is needed to communicate wouldn't work so the student is taught a lesson do not switch sections. The university has a large array of magnificent teachers but some of them couldn't even teach but that's to be expected no university is perfect just know that outside the campus it becomes a major shit show bunch street kids and beggars the sweet aroma of disposed waste by the side of the road will increase your life span.",
                    "numComments": 1
                },
                {
                    "commentid": 3,
                    "user": "nathan",
                    "comment": "if you’re an extrovert i think DLSU is the best univ. people are very social and there’s a lot of events on and off campus (at least during my time) plus everywhere i go i always meet a schoolmate and there’s an instant connection agad",
                    "numComments": 1
                }
            ]
        }
    ],
    "users": [
        {
            "displayName": "nathan",
            "user": "nathan",
            "bio": "hi I’m nathan! nice to meet you, let’s be good friends :)",
            "posts": 32,
            "img": "https://scontent.fcrk1-4.fna.fbcdn.net/v/t39.30808-6/294806317_10161195484146808_7368166100708413404_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=174925&_nc_eui2=AeEzwPJDrs-qbuZja_ve8yzDLpmo3Np8H48umajc2nwfj5KKHMUk_yC3ZBgmx6sJhp0&_nc_ohc=Anb7RMigl9gAX9Cfbr8&_nc_ht=scontent.fcrk1-4.fna&oh=00_AfC47pe4WZDVj6LPItxBMqXPRuJie5xpLoC6NDSGr5JoHw&oe=649A5AAE"
        },
        {
            "displayName": "patty",
            "user": "patty",
            "bio": "it's me hi, i'm the problem it's me",
            "posts": 32,
            "img": "https://scontent.fcrk1-5.fna.fbcdn.net/v/t39.30808-6/323044217_594634382671516_7065407932327472719_n.jpg?stp=cp6_dst-jpg&_nc_cat=104&ccb=1-7&_nc_sid=09cbfe&_nc_eui2=AeGnmu13q1N7RVAwPri2U23_EaVpWHtd0LARpWlYe13QsGq2Sqi4hyi4xJSBhCnvnIY&_nc_ohc=-PhjMCGNlyYAX_5-S6j&_nc_ht=scontent.fcrk1-5.fna&oh=00_AfAQjLNtIkKiSaVpihUB5iOL-ncJSHL8xzMTehgS6d1OuA&oe=64933C2C"
        },
        {
            "displayName": "Matt Escober",
            "user": "matt",
            "bio": "I AM A WHITE BOY",
            "posts": 32,
            "img": "https://www.codespeedy.com/wp-content/uploads/2020/01/low.jpg"
        },
        {
            "displayName": "jex",
            "user": "jex",
            "bio": "yo wats up hello",
            "posts": 32,
            "img": "https://i.pinimg.com/236x/71/28/3b/71283bb49db55cfee5bb6acd1389c465--tree-of-life-the-tree.jpg"
        },
        {
            "displayName": "Ceejay Pascasio",
            "user": "christian_james",
            "bio": "cavite is the best",
            "posts": 32,
            "img": "https://images.unsplash.com/photo-1544005313-94ddf0286df2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1yZWxhdGVkfDE0fHx8ZW58MHx8fHx8&w=1000&q=80"
        }
    ]
}